In [1]:
import pandas as pd

In [60]:
data = pd.read_csv('data.csv')

In [3]:
data.head()

   Class                               Name
0      1                   E. D. Abbott Ltd
1      1                     Schwan-Stabilo
2      1                         Q-workshop
3      1  Marvell Software Solutions Israel
4      1        Bergan Mercy Medical Center

In [4]:
data.groupby('Class').count()

        Name
Class
1      40000
2      40000
3      40000
4      40000
5      40000
6      40000
7      40000
8      40000
9      40000
10     40000
11     40000
12     40000
13     40000
14     28787

In [18]:
data[data.Class == 14]

        Class                                     Name
520000     14                          Kaiketsu Zorori
520001     14                  How to Live (biography)
520002     14        I Can Do Bad All by Myself (play)
520003     14                         The Tree Butcher
520004     14                      The First Sir Percy
...       ...                                      ...
548782     14           The Worst Band in the Universe
548783     14                    Poor Arnold's Almanac
548784     14  The Girls' Guide to Hunting and Fishing
548785     14       Wash This Blood Clean from My Hand
548786     14       Virginia Environmental Law Journal

[28787 rows x 2 columns]

In [8]:
data[data.Class == 3]

        Class                     Name
80000       3         Erin Morgenstern
80001       3           Samta Benyahia
80002       3           Morton Stevens
80003       3  Esfandiar Monfaredzadeh
80004       3              Cao Baoping
...       ...                      ...
119995      3  Andrew Irvine (bassist)
119996      3             Dave Reffett
119997      3    Clémentine (musician)
119998      3             Colin Linden
119999      3            Shahar Marcus

[40000 rows x 2 columns]

In [44]:
from utils import preprocess_data

In [45]:
pp_data = preprocess_data(data)

In [46]:
pp_data.head()

   Class                               Name
0      1                     e d abbott ltd
1      1                     schwan-stabilo
2      1                         q-workshop
3      1  marvell software solutions israel
4      1        bergan mercy medical center

In [55]:
ncounts = pp_data.groupby('Name').count()

In [56]:
ncounts[ncounts.Class > 1]

                       Class
Name
a album                    2
al manara tower            2
al rai                     2
alphabet book              2
an inconvenient truth      2
...                      ...
victory ship               2
vips                       2
word magazine              2
you                        2
youre only young once      2

[97 rows x 1 columns]

In [59]:
pp_data.merge(ncounts[ncounts.Class > 1].reset_index()['Name'], on='Name')

     Class                    Name
0        1                 genicom
1        1                 genicom
2        1                interjet
3        1                interjet
4        1                    elvo
..     ...                     ...
189     14                  al rai
190     14         boys love manga
191     14         boys love manga
192     14  the liberator magazine
193     14  the liberator magazine

[194 rows x 2 columns]

In [69]:
data[data.Name.str.lower().str.contains("vip's")]

       Class   Name
32436      1  VIP's

In [72]:
data.head().to_dict(orient='records')

[{'Class': 1, 'Name': 'E. D. Abbott Ltd'},
 {'Class': 1, 'Name': 'Schwan-Stabilo'},
 {'Class': 1, 'Name': 'Q-workshop'},
 {'Class': 1, 'Name': 'Marvell Software Solutions Israel'},
 {'Class': 1, 'Name': 'Bergan Mercy Medical Center'}]